Revit.Application.FamilyDocument.InternalFamilyDocument
Internal reference to the Document

Revit.Application.FamilyDocument.Category
Retrieves the Category object that represents the category or sub category in which the elements ( this family could generate ) reside.

Revit.Application.FamilyDocument.Parameters
All family parameters in this family.

Revit.Application.FamilyDocument.Types
All family type names in the family document.

Revit.Application.FamilyDocument.SetCategory(Revit.Elements.Category)
Sets the Category of the Family.
category: Category to set.
Returns: The document family

Revit.Application.FamilyDocument.SetFormula(System.String,System.String)
Set the formula of a family parameter (syntax is exactly as Revit, whatever works in Revit's formulas works here).
parameterName: The family parameter.
formula: The formula string.
Returns: The document family

Revit.Application.FamilyDocument.GetFormula(System.String)
Gets the formula of a family parameter.
parameterName: The family parameter.
Returns: The family parameter formula.

Revit.Application.FamilyDocument.GetParameterValueByName(System.String,System.String)
Gets the value of a family parameter of the current family type, this applies to all family parameters (instance and type).
parameterName: A family parameter of the current type.
familyTypeName: The name of the family type.
Returns: The parameter value.

Revit.Application.FamilyDocument.SetParameterValueByName(System.String,System.String,System.Object)
Set the value of a family parameter of the current family type, this applies to all family parameters (instance and type).
familyTypeName: The name of Family Type
parameter: A family parameter of the current type.
value: The new value for the family parameter.
Returns: The family document with an updated value for the specified parameter.

Revit.Application.FamilyDocument.AddParameter(System.String,System.String,System.String,System.Boolean)
Add a new family parameter with a given name.
parameterName: The name of the new family parameter.
parameterGroup: The name of the group to which the family parameter belongs.
parameterType: The name of the type of new family parameter.
isInstance: Indicates if the new family parameter is instance or type (true if parameter should be instance).
Returns: The new family parameter.

Revit.Application.FamilyDocument.DeleteParameter(System.String)
Remove an existing family parameter from the family.
parameterName: The family parameter name.
Returns: The id of the deleted family parameter.

Revit.Application.FamilyDocument.ByDocument(Revit.Application.Document)
Get FamilyDocument from a Document
if this document is a Family Document.
document:
Returns: